dinos_app/app/controllers/dinos_controller.rb

SELECT "dinos".* FROM "dinos"
---
  def index
    # you need to get all Dinos from the database
    @dinos = Dino.all

SELECT  "dinos".* FROM "dinos" WHERE "dinos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dino = Dino.find(params[:id])

INSERT INTO "dinos" ("name", "color", "breed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aileen"], ["color", "aileen"], ["breed", "aileen"], ["created_at", "2017-10-02 19:12:27.003454"], ["updated_at", "2017-10-02 19:12:27.003454"]]
---
  def create
    @dino = Dino.new(dino_params)

    respond_to do |format|
      if @dino.save

UPDATE "dinos" SET "color" = $1, "updated_at" = $2 WHERE "dinos"."id" = $3  [["color", "rainbow"], ["updated_at", "2017-10-02 19:39:30.160085"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @dino.update(dino_params)

DELETE FROM "dinos" WHERE "dinos"."id" = $1  [["id", 7]]
---
  def destroy
    @dino.destroy

SELECT  "dinos".* FROM "dinos" WHERE "dinos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_dino
    @dino = Dino.find(params[:id])